region_mapping_table = {

    "北部": [
        "請選擇城市",
        "台北市",
        "新北市",
        "桃園市",
        "新竹縣"
    ],
    
    "中部":[
        "請選擇城市",
        "台中市",
        "南投縣"
    ],
    
    "南部":[
        "請選擇城市",
        "嘉義市",
        "台南市",
        "高雄市"
    ]
};

locations = [{
    'name': '文化館門市',
    'address': '新北市土城區國際路55號(創意和菓子觀光工廠)',
    'phone': '02-82620506',
    'city': '新北市',
    'poi': {
        'Latitude': '24.978024',
        'Longitude': '121.466649'
    }
}, {
    'name': '忠孝旗艦門市',
    'address': '台北市大安區忠孝東路3段289號(忠孝復興1號出口)',
    'phone': '02-27752298',
    'city': '台北市',
    'poi': {
        'Latitude': '25.041842',
        'Longitude': '121.543504'
    }
}, {
    'name': '台北101門市',
    'address': '台北市信義區市府路45號(台北101購物中心B1)',
    'phone': '02-81018698',
    'city': '台北市',
    'poi': {
        'Latitude': '25.033479',
        'Longitude': '121.564549'
    }
}, {
    'name': '微風台北車站門市',
    'address': '台北市中正區北平西路3號1樓',
    'phone': '02-23120798',
    'city': '台北市',
    'poi': {
        'Latitude': '25.047697',
        'Longitude': '121.517556'
    }
}, {
    'name': '西門町門市',
    'address': '台北市萬華區武昌街二段22號(西門徒步區內)',
    'phone': '02-23613956',
    'city': '台北市',
    'poi': {
        'Latitude': '25.044348',
        'Longitude': '121.507402'
    }
}, {
    'name': '松山機場門市',
    'address': '台北市松山區敦化北路340之9號1樓(松山機場大廳)',
    'phone': '02-27193356',
    'city': '台北市',
    'poi': {
        'Latitude': '25.063672',
        'Longitude': '121.552427'
    }
}, {
    'name': '環球板橋車站門市',
    'address': '新北市板橋區縣民大道二段7號B1樓',
    'phone': '02-89692088',
    'city': '新北市',
    'poi': {
        'Latitude': '25.014379',
        'Longitude': '121.463512'
    }
}, {
    'name': '九份門市',
    'address': '新北市瑞芳區九份基山街6號(九份老街)',
    'phone': '02-24063817',
    'city': '新北市',
    'poi': {
        'Latitude': '25.109617',
        'Longitude': '121.845288'
    }
}, {
    'name': '一航廈門市',
    'address': '桃園市大園區航站南路15號3樓(北側)',
    'phone': '03-3931699',
    'city': '桃園市',
    'poi': {
        'Latitude': '25.081104',
        'Longitude': '121.237018'
    }
},{
    'name': '二航廈門市',
    'address': '桃園市大園區航站南路9號2樓(西側)',
    'phone': '03-3931588',
    'city': '桃園市',
    'poi': {
        'Latitude': '25.077012',
        'Longitude': '121.231979'
    }
},{
    'name': '桃園台茂門市',
    'address': '桃園市蘆竹區南崁路一段112號5樓(台茂購物中心)',
    'phone': '03-3520629',
    'city': '桃園市',
    'poi': {
        'Latitude': '25.053453',
        'Longitude': '121.288382'
    }
},{
    'name': '關西門市',
    'address': '新竹縣關西鎮東安里上三屯14號(關西服務區)',
    'phone': '03-5871199',
    'city': '新竹縣',
    'poi': {
        'Latitude': '24.801103',
        'Longitude': '121.192454'
    }
},{
    'name': '清水門市',
    'address': '台中市清水區吳厝里吳厝二街89號(清水服務區)',
    'phone': '04-26203303',
    'city': '台中市',
    'poi': {
        'Latitude': '24.281376',
        'Longitude': '120.601311'
    }
},{
    'name': '台中中友門市',
    'address': '台中市北區三民路3段161號B棟B2樓(台中中友百貨)',
    'phone': '04-22299098',
    'city': '台中市',
    'poi': {
        'Latitude': '24.152213',
        'Longitude': '120.684781'
    }
},{
    'name': '南投桃太郎村門市',
    'address': '南投縣竹山鎮保甲路186號(桃太郎村)',
    'phone': '049-2651899',
    'city': '南投縣',
    'poi': {
        'Latitude': '23.775489',
        'Longitude': '120.70993'
    }
},{
    'name': '嘉義中山門市',
    'address': '嘉義市西區中山路459號',
    'phone': '05-2272525',
    'city': '嘉義市',
    'poi': {
        'Latitude': '23.479413',
        'Longitude': '120.445945'
    }
},{
    'name': '東山門市',
    'address': '台南市東山區科里里枋子林74-6號(東山服務區)',
    'phone': '06-6231969',
    'city': '台南市',
    'poi': {
        'Latitude': '23.286241',
        'Longitude': '120.398265'
    }
},{
    'name': '南紡購物中心門市',
    'address': '台南市東區中華東路一段366號B1樓(南紡購物中心)',
    'phone': '06-2380011',
    'city': '台南市',
    'poi': {
        'Latitude': '22.990729',
        'Longitude': '120.233101'
    }
},{
    'name': '新光三越西門門市',
    'address': '台南市中西區西門路一段658號B2樓(新光三越西門店)',
    'phone': '06-3031188',
    'city': '台南市',
    'poi': {
        'Latitude': '22.986825',
        'Longitude': '120.197705'
    }
},{
    'name': '高雄夢時代門市',
    'address': '高雄市前鎮區中華五路789號B1樓(夢時代購物中心)',
    'phone': '07-9708866',
    'city': '高雄市',
    'poi': {
        'Latitude': '22.595042',
        'Longitude': '120.307141'
    }
},{
    'name': '高雄草衙道門市3B-03',
    'address': '高雄市前鎮區中安路1-1號3樓',
    'phone': '07-7917288',
    'city': '高雄市',
    'poi': {
        'Latitude': '22.582486',
        'Longitude': '120.328897'
    }
},{
    'name': '漢神巨蛋門市',
    'address': '高雄市左營區博愛二路777號B1樓(漢神巨蛋購物廣場)',
    'phone': '07-5225678',
    'city': '高雄市',
    'poi': {
        'Latitude': '22.669993',
        'Longitude': '120.302775'
    }
},{
    'name': '高雄佛陀紀念館門市',
    'address': '高雄市大樹區統嶺路1號(佛陀紀念館)',
    'phone': '07-6565820',
    'city': '高雄市',
    'poi': {
        'Latitude': '22.755892',
        'Longitude': '120.445209'
    }
}];
